In [1]:
import numpy as np
import pandas as pd

In [2]:
myData = {'Pratyush': [3, 5, np.nan], 'Pratik': [4, np.nan, np.nan], 'Sinha': [3, 5, 4]}

In [3]:
myData

{'Pratyush': [3, 5, nan], 'Pratik': [4, nan, nan], 'Sinha': [3, 5, 4]}

In [4]:
myDataFrame = pd.DataFrame(myData)

In [5]:
myDataFrame

   Pratyush  Pratik  Sinha
0       3.0     4.0      3
1       5.0     NaN      5
2       NaN     NaN      4

In [6]:
myDataFrame.dropna()

   Pratyush  Pratik  Sinha
0       3.0     4.0      3

In [7]:
myDataFrame

   Pratyush  Pratik  Sinha
0       3.0     4.0      3
1       5.0     NaN      5
2       NaN     NaN      4

In [8]:
myDataFrame.fillna(value=myDataFrame['Pratyush'].mean()) #fillna - fill null value

   Pratyush  Pratik  Sinha
0       3.0     4.0      3
1       5.0     4.0      5
2       4.0     4.0      4

In [9]:
myDataFrame.fillna(value=myDataFrame['Pratik'].mean())

   Pratyush  Pratik  Sinha
0       3.0     4.0      3
1       5.0     4.0      5
2       4.0     4.0      4

In [10]:
myDataFrame

   Pratyush  Pratik  Sinha
0       3.0     4.0      3
1       5.0     NaN      5
2       NaN     NaN      4

## Video 2

In [11]:
newData = {
    'Movies': ['Star-Wars', 'Star-Wars', 'Batman', 'Batman', 'Deadpool', 'Deadpool'],
    'Viewers': ['Me', 'MF', 'MOF', 'Pratyush', 'Pratik', 'Prats'],
    'Ratings': [10, 7, 6, 9, 8, 5]
}

In [12]:
newData

{'Movies': ['Star-Wars',
  'Star-Wars',
  'Batman',
  'Batman',
  'Deadpool',
  'Deadpool'],
 'Viewers': ['Me', 'MF', 'MOF', 'Pratyush', 'Pratik', 'Prats'],
 'Ratings': [10, 7, 6, 9, 8, 5]}

In [13]:
movieFrame = pd.DataFrame(newData)

In [14]:
movieFrame

      Movies   Viewers  Ratings
0  Star-Wars        Me       10
1  Star-Wars        MF        7
2     Batman       MOF        6
3     Batman  Pratyush        9
4   Deadpool    Pratik        8
5   Deadpool     Prats        5

In [15]:
movieFrame.groupby('Viewers')

In [16]:
movieFrame.groupby('Viewers').mean()

          Ratings
Viewers
MF              7
MOF             6
Me             10
Pratik          8
Prats           5
Pratyush        9

In [17]:
movieFrame.groupby('Movies').mean()

           Ratings
Movies
Batman         7.5
Deadpool       6.5
Star-Wars      8.5

In [18]:
movieFrame.groupby('Movies').std()

           Ratings
Movies
Batman     2.12132
Deadpool   2.12132
Star-Wars  2.12132

In [19]:
movieFrame.groupby('Movies').std().loc['Batman']

Ratings    2.12132
Name: Batman, dtype: float64

In [21]:
movieFrame.groupby('Movies').std().iloc[1]

Ratings    2.12132
Name: Deadpool, dtype: float64

### you can use describe to find some useful operations

In [22]:
movieFrame.groupby('Movies').describe()

          Ratings
            count mean      std  min   25%  50%   75%   max
Movies
Batman        2.0  7.5  2.12132  6.0  6.75  7.5  8.25   9.0
Deadpool      2.0  6.5  2.12132  5.0  5.75  6.5  7.25   8.0
Star-Wars     2.0  8.5  2.12132  7.0  7.75  8.5  9.25  10.0